#include <cmath> // бібліотека математичних функцій
#include <iostream> // бібліотека потоків вводу-виводу
using namespace std;

int main() // основна функція - точка входу до програми
{          // початок основної функції
  cout << "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^"
       << endl; // виведення відомостей про
                // лабораторну роботу
  cout << "Лабораторна робота №1" << endl;
  cout << "Студент Шишкін Андрій Антонович, ІПЗ-11, Варіант 25" << endl;
  cout << "Завдання 1. За даними, що  введені з клавіатури в оперативну "
          "пам’ять, визначити значення  виразу, використовуючи математичні "
          "функції, і вивести результат на екран. Вираз вибрати згідно з "
          "варіантом 25. Довільні значення змінних A,B,C,D ввести з клавіатури."
       << endl;
  cout << "X=sin^3 C Cos^2 A / (e^A + 1 + SinB)" << endl;
  cout << "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^" << endl;
  double A, B, C;
  // Введення значень змінних
  while (true) 
  {
    cout << "Введіть значення А: ";
    cin >> A;

    if (cin.fail()) 
    { // робить перевірку ошибок
      cout << "Помилка: неправильний символ. Можно тільки число. Спробуйте ще "
              "раз.\n";
      cin.clear(); // сброс ошибок
      cin.ignore(numeric_limits<streamsize>::max(), '\n'); // очистити буфер
    } else 
    {
      break;
    }
  }

  while (true) 
  {
    cout << "Введіть значення B: ";
    cin >> B;

    if (cin.fail()) 
    {
      cout << "Помилка: неправильний символ. Можно тільки число. Спробуйте ще "
              "раз.\n";
      cin.clear();
      cin.ignore(numeric_limits<streamsize>::max(), '\n'); // очистити буфер
    } else 
    {
      break;
    }
  }

  while (true) 
  {
    cout << "Введіть значення C: ";
    cin >> C;

    if (cin.fail()) 
    {
      cout << "Помилка: неправильний символ. Можно тільки число. Спробуйте ще "
              "раз.\n";
      cin.clear();
      cin.ignore(numeric_limits<streamsize>::max(), '\n'); // очистити буфер
    } else 
    {
      break;
    }
  }
  // Обчислення виразу
  double X = pow(sin(C), 3) * pow(cos(A), 2) / (exp(A) + 1 + sin(B));

  // Виведення результату
  cout << "Результат обчислення X = " << X
       << std::endl; // форматне виведення результату

  return 0; // завершення програми
}
