#include <cmath>    // бібліотека математичних функцій
#include <iostream> // бібліотека потоків вводу-виводу

int main() // основна функція - точка входу до програми
{          // початок основної функції
  double A, B, C;

  // Введення значень змінних
  std::cout << "Введіть значення A: "; // вивід повідомлення на екран
  std::cin >> A;                       // ввід значення з клавіатури

  std::cout << "Введіть значення B: "; // вивід повідомлення на екран
  std::cin >> B;                       // ввід значення з клавіатури

  std::cout << "Введіть значення C: "; // вивід повідомлення на екран
  std::cin >> C;                       // ввід значення з клавіатури

  // Обчислення виразу
  double X = pow(sin(C), 3) * pow(cos(A), 2) / (exp(A) + 1 + sin(B));

  // Виведення результату
  std::cout << "Результат обчислення X = " << X << std::endl; // форматне виведення результату

  return 0; // завершення програми
}