
#include <iostream>
using namespace std;

void printDigitsReversed(int n)
{
  if (n < 10)
  {
    cout << n << " ";
    return;
  }

  cout << n % 10 << " ";

  printDigitsReversed(n / 10);
}

void welcome()
{
  cout << "---------------------------------------" << endl;
  cout << "Лабораторна робота №5" << endl;
  cout << "Студент Шишкін Андрій Антонович, ІПЗ-11, Варіант 25" << endl;
  cout << "Увести з клавіатури натуральне число n. Вивести всі його \n цифри "
          "по одній в зворотному порядку, розділяючи їх пробілами або новими "
          "рядками.\n При розв'язанні цього завдання не можна використовувати "
          "цикли, рядки, списки, масиви.\n Дозволена тільки рекурсія і "
          "целочисельна арифметика.\n Контрольний тест: введено число 123, "
          "отриманий результат: 3 2 1"
       << endl;
  cout << "---------------------------------------" << endl;
}

int main()
{
  int n;
  cout << "Введіть натуральне число: ";
  cin >> n;

  printDigitsReversed(n);

  return 0;
}
