import Analiz from '../../components/Analiz/Analiz'

export default function AnalizLab() {
	return (
		<Analiz
			analizText={
				<div>
					<div>
						<p>
							<p className='text-sky-500'>Аналіз Завдання 1:</p>
							Для аналізу виконання завдання, пов язаного з обчисленням значення
							функції f(x)f(x), залежно від введеного значення аргументів aa і
							bb, виконаємо такі кроки:
							<br />
							Кроки виконання:
							<ol className='list-decimal'>
								<li>
									Постановка задачі: Визначити значення функції f(x)f(x) на
									основі формул, наведених у зображенні, залежно від значень aa
									та bb, які вводяться користувачем з клавіатури.
								</li>
								<li>
									Алгоритм розв’язання{' '}
									<ol>
										<li>
											Зчитати вхідні дані: користувач вводить aa та bb з
											клавіатури.
										</li>
										<li>
											Обчислення значення функції:
											<p>Перевірити, чи b=0: якщо так, значення f(x)=0.</p>
											<p>Перевірити, чи b!=0: Порівняти a і b</p>
										</li>
										<li>Вивести результат на екран.</li>
									</ol>
								</li>
								<li>Перевірка на ділення на нуль</li>
							</ol>
						</p>
					</div>
					<div>
						<p className='text-sky-500'>Аналіз Завдання 2:</p>
						<p>
							Для розв язання задачі визначимо меншу діагональ ромба,
							використовуючи властивості ромба та тригонометричні
							співвідношення.
						</p>
						<h3 className='text-lg'>Властивості ромба:</h3>
						<ul>
							<li>Усі сторони ромба рівні.</li>
							<li>
								Периметр ромба <code>P = 4a</code>, де <code>a</code> — довжина
								сторони ромба.
							</li>
							<li>
								Діагоналі ромба перпендикулярні і ділять одна одну навпіл.
							</li>
						</ul>

						<h3 className='text-lg'>Дано:</h3>
						<ul>
							<li>
								Висота, проведена з тупого кута, ділить сторону ромба навпіл. Ця
								висота є також частиною одного з трикутників, утворених
								діагоналями.
							</li>
						</ul>

						<h3 className='text-lg'>Ціль:</h3>
						<ul>
							<li>
								Знайти меншу діагональ ромба{' '}
								<code>
									d<sub>1</sub>
								</code>
								, якщо відомий периметр.
							</li>
						</ul>
						<h3>Розв язання:</h3>
						<ul>
							<li>
								Знаємо, що периметр ромба <code>P = 4a</code>, отже, довжина
								сторони ромба <code>a = P / 4</code>.
							</li>
							<li>
								Висота ділить сторону навпіл, тобто утворює прямокутний
								трикутник, в якому катети:
								<ul>
									<li>
										половина сторони <code>a / 2</code>,
									</li>
									<li>
										половина меншої діагоналі{' '}
										<code>
											d<sub>1</sub> / 2
										</code>
										.
									</li>
								</ul>
							</li>
							<li>
								З теореми Піфагора для цього трикутника маємо рівняння:
								<br />
								<code>
									a<sup>2</sup> = (d<sub>1</sub> / 2)<sup>2</sup> + (a / 2)
									<sup>2</sup>
								</code>
								.
							</li>
							<li>
								Розв язуючи це рівняння, можна знайти меншу діагональ{' '}
								<code>
									d<sub>1</sub>
								</code>
								.
							</li>
						</ul>
					</div>
				</div>
			}
		/>
	)
}
