import Umova from "../../components/Umova/Umova";
import var25 from "./assets/var25.gif";

export default function UmovaLab() {
  return (
    <Umova
      umovaText={
        <div>
          <div>
            <p>
              <span className="text-sky-500">Завдання 1.</span> Визначити
              значення функції в залежності від значення її аргументу, яке
              вводиться з клавіатури. Умови завдання 1 подані в таблиці 2.1 по
              варіантах.
            </p>
            <img className="py-4" src={var25} alt="task1" />
          </div>
          <div>
            <p>
              <span className="text-sky-500">Завдання 2.</span>
              Розв язати геометричну або логічну задачу. Умови завдання 2 подані
              в таблиці 2.2 по варіантах.
            </p>
            <p>
              Точка площини задана декартовими координатами (x,y), значення яких
              введені з клавіатури. Перевірити, чи належить вона першому;
              другому; третьому; четвертому координатному квадранту. Вивести
              відповідне повідомлення. Якщо точка належить першому квадранту, то
              визначити відстань її до початку координат (0, 0).
            </p>
          </div>
        </div>
      }
    />
  );
}
