import Analiz from '../../components/Analiz/Analiz'

export default function AnalizLab() {
	return (
		<Analiz
			analizText={
				<div>
					<div>
						<p>
							<p className='text-sky-500'>Аналіз Завдання 1:</p>
							Необхідно розробити програму, яка приймає з клавіатури значення
							змінних A, B, C , обчислює вираз за допомогою математичних функцій
							і вивить результат на екран.
							<br />
							Кроки виконання:
							<ol className='list-decimal'>
								<li>
									Введення даних: Програма повинна зчитувати значення чотирьох
									змінних типу A, B, C з клавіатури.
								</li>
								<li>
									Обчислення виразу: Вираз для обчислення не вказаний, тому його
									необхідно задати або уточнити у формулюні завдання.
								</li>
								<li>
									Використання математичних функцій: як синус (sin()), косинус
									(cos()), квадратний корінь (sqrt()),степені тощо.
								</li>
								<li>
									Виведення результату: Після обчислення результат необхідно
									вивести на екран.
								</li>
							</ol>
						</p>
					</div>
					<div>
						<p className='text-sky-500'>Аналіз Завдання 2:</p>
						<p>
							Для розв язання задачі визначимо меншу діагональ ромба,
							використовуючи властивості ромба та тригонометричні
							співвідношення.
						</p>
						<h3 className='text-lg'>Властивості ромба:</h3>
						<ul>
							<li>Усі сторони ромба рівні.</li>
							<li>
								Периметр ромба <code>P = 4a</code>, де <code>a</code> — довжина
								сторони ромба.
							</li>
							<li>
								Діагоналі ромба перпендикулярні і ділять одна одну навпіл.
							</li>
						</ul>

						<h3 className='text-lg'>Дано:</h3>
						<ul>
							<li>
								Висота, проведена з тупого кута, ділить сторону ромба навпіл. Ця
								висота є також частиною одного з трикутників, утворених
								діагоналями.
							</li>
						</ul>

						<h3 className='text-lg'>Ціль:</h3>
						<ul>
							<li>
								Знайти меншу діагональ ромба{' '}
								<code>
									d<sub>1</sub>
								</code>
								, якщо відомий периметр.
							</li>
						</ul>
						<h3>Розв язання:</h3>
						<ul>
							<li>
								Знаємо, що периметр ромба <code>P = 4a</code>, отже, довжина
								сторони ромба <code>a = P / 4</code>.
							</li>
							<li>
								Висота ділить сторону навпіл, тобто утворює прямокутний
								трикутник, в якому катети:
								<ul>
									<li>
										половина сторони <code>a / 2</code>,
									</li>
									<li>
										половина меншої діагоналі{' '}
										<code>
											d<sub>1</sub> / 2
										</code>
										.
									</li>
								</ul>
							</li>
							<li>
								З теореми Піфагора для цього трикутника маємо рівняння:
								<br />
								<code>
									a<sup>2</sup> = (d<sub>1</sub> / 2)<sup>2</sup> + (a / 2)
									<sup>2</sup>
								</code>
								.
							</li>
							<li>
								Розв язуючи це рівняння, можна знайти меншу діагональ{' '}
								<code>
									d<sub>1</sub>
								</code>
								.
							</li>
						</ul>
					</div>
				</div>
			}
		/>
	)
}
