import Umova from '../../components/Umova/Umova'

export default function UmovaLab() {
	return (
		<Umova
			umovaText={
				<div>
					<div>
						<p>
							<span className='text-sky-500'>Завдання 1.</span> За даними, що
							введені з клавіатури в оперативну пам’ять, визначити значення
							виразу, використовуючи математичні функції, і вивести результат на
							екран. Довільні значення змінних A,B,C,D ввести з клавіатури.
						</p>
						<img
							className='py-4'
							src='/src/pages/lab1/assets/var25.gif'
							alt='task1'
						/>
					</div>
					<div>
						<p>
							<span className='text-sky-500'>Завдання 2.</span>
							Написати програму, що розв`язує задачу з математики та фізики
							шкільногого курсу.
						</p>
						<p>
							Висота ромба, проведена з вершини тупого кута, ділить сторону
							навпіл. Знайдіть меншу діагональ, якщо значення периметра ромба
							введене з клавіатури.
						</p>
					</div>
				</div>
			}
		/>
	)
}
