#include <iostream>
#include <cmath>
using namespace std;

bool isValidInput(double &x) 
{
    if (cin >> x) 
    {
        return true;
    }
    cin >> ws;
    return false;
}

int main() 
{
    cout << "---------------------------------------" << endl;
    cout << "Лабораторна робота №2" << endl;
    cout << "Студент Шишкін Андрій Антонович, ІПЗ-11, Варіант 25" << endl;
    cout << "Розв'язати геометричну або логічну задачу."<< endl;
    cout << "Точка площини задана декартовими координатами (x,y), значення яких введені з клавіатури. Перевірити, чи належить вона першому; другому; третьому; четвертому координатному квадранту. Вивести відповідне повідомлення. Якщо точка належить першому квадранту, то визначити відстань її до початку координат (0, 0)." << endl;
    cout << "---------------------------------------" << endl;

    double x, y;

    cout << "Введіть координату x: ";
    while (!isValidInput(x)) 
    {
        cout << "Помилка ввода! Будьласка, введить корректне число для x: ";
    }

    cout << "Введіть координату y: ";
    while (!isValidInput(y)) 
    {
        cout << "Помилка ввода! Будьласка, введить корректне число для y: ";
    }

    if (x > 0 && y > 0) 
    {
        cout << "Точка знаходиться у першому квадранті.\n";
        double distance = sqrt(x * x + y * y);
        cout << "Відстань до початку координат: " << distance << endl;
    } 
    else if (x < 0 && y > 0) 
    {
        cout << "Точка знаходиться у другому квадранте.\n";
    } 
    else if (x < 0 && y < 0) 
    {
        cout << "Точка знаходиться в третьому квадранте.\n";
    } 
    else if (x > 0 && y < 0) 
    {
        cout << "Точка знаходиться в четвертому квадранте.\n";
    } 
    else if (x == 0 && y == 0) 
    {
        cout << "Точка знаходиться на початку координат.\n";
    } 
    else if (x == 0) 
    {
        cout << "Точка знаходиться на оси Y.\n";
    } 
    else if (y == 0) 
    {
        cout << "Точка знаходиться на оси X.\n";
    }

    return 0;
}

